# Приведенные примеры не являются догмой, Вы можете предложить свои варианты. Основной критерий, 
# чтобы клиент отправлял JSON сообщение и получал подобное JSON сообщение с кодом, например 202 
# «об успешной отправке». Для других действий коды ответов представлены на следующем слайде 
# (не обязательно реализовывать все). Такое поведение нужно для дальнейшего возможного расширения
#  функционала и для закрепления навыков работы с JSON. 

# 2. Реализовать возможность отправки сообщений другим клиентам; (сделать можно различными 
# способами, например, добавить адресата в JSON сообщение и реализовать соответствующее поведение 
# на сервере)
