# Домашнее задание будет заключаться в реализации простого эхо-чата с использованием JSON сообщений:
# клиент(ы) отправляет запрос (сообщение) серверу;
# сервер возвращает это же сообщение всем клиентам, кроме пославшего;
# Клиент и сервер должны быть реализованы в виде отдельных скриптов, содержащих соответствующие функции.
# Необходимо использовать несколько потоков на клиенте (один обрабатывает действие отправки сообщений, другой их получение).
# ВАЖНО: Для обмена в качестве сообщений использовать JSON объекты. Пример JSON объекта представлен на следующем слайде.
