# 1. Реализовать модели, необходимые для реализации доски объявлений (подобной Avito).
#  Предлагаемая структура: У каждого “Пользователя” (у него есть фото профиля и дата 
#  рождения, помимо стандартной реализации) есть множество “Объявлений” (Например: 
#  “Продам гараж и.т.п.”, обязательно есть заголовок, описание и фото), которые 
#  разбиты по “Категориям” (Например: “Транспорт, недвижимость и.т.д.”)use

# 2. Заполнить разработанные модели (ОБЯЗАТЕЛЬНО: через оболочку (manage.py shell), 
# 2-3 записи, добавить скриншот для отчета).

# 3. По желанию, опр=еделите дополнительные поля в моделях и/или дополнительные модели. 
# Можете вдохновляться Avito, Циан, auto.ru и подобными. Попытайтесь максимально точно
# определить какие поля вам нужны и какого типа.

# 4. Получить в оболочке shell (*или в view):
# 	a. Объявления, которые были опубликованы сегодня; 
# 	б. Объявления, принадлежащие конкретному пользователю;
# 	в. Объявления, по определенной категории
# 	добавить скриншот для отчета.

# 5. Создать супер-пользователя и добавить 2-3 объявления через админку-django, добавить скриншот для отчета.

